{
  "credentials": [
    {
      "id": 1,
      "username": "test",
      "password": "test",
      "name": "Ward"
    },
    {
      "id": 2,
      "username": "ward",
      "password": "mck",
      "name": "Mike"
    },
    {
      "username": "trowt",
      "password": "12345",
      "id": 3
    }
  ],
  "excercises": [
    {
      "exercise": "Pushup",
      "description": "The push-up (sometimes called a press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole",
      "sets": "3",
      "reps": "10",
      "id": 1,
      "action": "Completed",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Liegestuetz02_ani_fcm.gif/440px-Liegestuetz02_ani_fcm.gif"
    },
    {
      "exercise": "Pullup",
      "description": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands and pulls up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso.",
      "sets": "3",
      "reps": "8",
      "id": 2,
      "action": "Completed",
      "img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/u05-bottomhalfwaytop-ism-mh310118-1558552383.jpg?crop=1.00xw:0.812xh;0,0.0812xh&resize=480:*"
    },
    {
      "exercise": "Squat",
      "description": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent of a squat, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. ",
      "sets": "3",
      "reps": "10",
      "id": 3,
      "action": "Completed",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Squats.svg/1600px-Squats.svg.png"
    },
    {
      "exercise": "Bench Press",
      "description": "The bench press, or chest press, is an upper-body weight training exercise in which the trainee presses a weight upwards while lying on a weight training bench. The exercise uses the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.",
      "sets": "3",
      "reps": "10",
      "id": 4,
      "action": "Pending",
      "img": "https://i.pinimg.com/originals/51/1f/75/511f758a1ef6d337f075b820c4cc49de.gif"
    },
    {
      "exercise": "Dumbell Curl",
      "description": "Stand by holding a dumbbell in each hand with your arms hanging by your sides. Ensure your elbows are close to your torso and your palms facing forward. Keeping your upper arms stationary, exhale as you curl the weights up to shoulder level while contracting your biceps.",
      "sets": "3",
      "reps": "10",
      "id": 5,
      "action": "Pending",
      "img": "https://hips.hearstapps.com/ame-prod-menshealth-assets.s3.amazonaws.com/main/assets/bicep-curl.gif"
    },
    {
      "exercise": "Jumping Jacks",
      "description": "    Begin by standing with your legs straight and your arms to your sides. Jump up and spread your feet beyond hip-width apart while bringing your arms above your head, nearly touching. Jump again, lowering your arms and bringing your legs together. Return to your starting position.",
      "sets": "5",
      "reps": "20",
      "id": 6,
      "action": "Pending",
      "img": "https://artimg.gympik.com/articles/wp-content/uploads/2020/02/jumping-jacks-gif-5.gif"
    }
  ]
}